# GetGUID Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AddInId..::..GetGUID Method
AddInId Class See Also
---
value of the AddInId as a GUID
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public Guid GetGUID()
```

Visual Basic
---
```text
Public Function GetGUID As Guid
```

Visual C++
---
```text
public:
Guid GetGUID()
```

# ### Return Value
GUID value of the AddInId
# See Also
AddInId Class
Autodesk.Revit.DB Namespace